   # Pandas

In [1]:
# install 

!pip install pydataset

Requirement already satisfied: pydataset in c:\programdata\anaconda3\lib\site-packages (0.2.0)
Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (from pydataset) (0.23.4)
Requirement already satisfied: python-dateutil>=2.5.0 in c:\programdata\anaconda3\lib\site-packages (from pandas->pydataset) (2.7.5)
Requirement already satisfied: pytz>=2011k in c:\programdata\anaconda3\lib\site-packages (from pandas->pydataset) (2018.7)
Requirement already satisfied: numpy>=1.9.0 in c:\programdata\anaconda3\lib\site-packages (from pandas->pydataset) (1.15.4)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.5.0->pandas->pydataset) (1.12.0)

In [9]:
import pandas as pd

# library with preinstalled datasets
from pydataset import data

# sklearn standard ML library for python has its own datasets
from sklearn import datasets

# Available datasets from pydataset.data
a = data()

# Read datasets from pydataset.data
titanic=data('titanic') # load the data
housing=data('Housing')

# read_csv from web location or from hard drive
drinks = pd.read_csv('http://bit.ly/drinksbycountry')

In [10]:
# daj prvih 5
drinks.head(5)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [11]:
# daj poslednjih 5
drinks.tail(5)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
188,Venezuela,333,100,3,7.7,South America
189,Vietnam,111,2,1,2.0,Asia
190,Yemen,6,0,0,0.1,Asia
191,Zambia,32,19,4,2.5,Africa
192,Zimbabwe,64,18,4,4.7,Africa

In [14]:
oneCountry = (drinks.country == 'Serbia')
drinks[oneCountry]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
151,Serbia,283,131,127,9.6,Europe

In [15]:
# prikazi tipove podataka

drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object